of2/circular-cylinder/system/blockMeshDict

FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    object   blockMeshDict;
}

convertToMeters 1.0;

vertices
(
	(0.5 0 -0.05) // 0
	(0.3535533905932738 0.35355339059327373 -0.05) // 1
	(0 0.5 -0.05) // 2
	(-0.35355339059327373 0.3535533905932738 -0.05) // 3
	(-0.5 0 -0.05) // 4
	(-0.35355339059327384 -0.35355339059327373 -0.05) // 5
	(0 -0.5 -0.05) // 6
	(0.3535533905932737 -0.35355339059327384 -0.05) // 7
	(1.0 0 -0.05) // 8
	(0.7071067811865477 0.7071067811865474 -0.05) // 9
	(0 1.0 -0.05) // 10
	(-0.7071067811865467 0.7071067811865483 -0.05) // 11
	(-1.0 0 -0.05) // 12
	(-0.7071067811865471 -0.7071067811865479 -0.05) // 13
	(0 -1.0 -0.05) // 14
	(0.7071067811865466 -0.7071067811865485 -0.05) // 15
	(6.0 0 -0.05) // 16
	(6.0 0.7071067811865474 -0.05) // 17
	(6.0 4.0 -0.05) // 18
	(0.7071067811865477 4.0 -0.05) // 19
	(0 4.0 -0.05) // 20
	(-0.7071067811865471 4.0 -0.05) // 21
	(-4.0 4.0 -0.05) // 22
	(-4.0 0.7071067811865474 -0.05) // 23
	(-4.0 0 -0.05) // 24
	(-4.0 -0.7071067811865479 -0.05) // 25
	(-4.0 -4.0 -0.05) // 26
	(-0.7071067811865471 -4.0 -0.05) // 27
	(0 -4.0 -0.05) // 28
	(0.7071067811865477 -4.0 -0.05) // 29
	(6.0 -4.0 -0.05) // 30
	(6.0 -0.7071067811865479 -0.05) // 31
	(0.5 0 0.05) // 32
	(0.3535533905932738 0.35355339059327373 0.05) // 33
	(0 0.5 0.05) // 34
	(-0.35355339059327373 0.3535533905932738 0.05) // 35
	(-0.5 0 0.05) // 36
	(-0.35355339059327384 -0.35355339059327373 0.05) // 37
	(0 -0.5 0.05) // 38
	(0.3535533905932737 -0.35355339059327384 0.05) // 39
	(1.0 0 0.05) // 40
	(0.7071067811865477 0.7071067811865474 0.05) // 41
	(0 1.0 0.05) // 42
	(-0.7071067811865467 0.7071067811865483 0.05) // 43
	(-1.0 0 0.05) // 44
	(-0.7071067811865471 -0.7071067811865479 0.05) // 45
	(0 -1.0 0.05) // 46
	(0.7071067811865466 -0.7071067811865485 0.05) // 47
	(6.0 0 0.05) // 48
	(6.0 0.7071067811865474 0.05) // 49
	(6.0 4.0 0.05) // 50
	(0.7071067811865477 4.0 0.05) // 51
	(0 4.0 0.05) // 52
	(-0.7071067811865471 4.0 0.05) // 53
	(-4.0 4.0 0.05) // 54
	(-4.0 0.7071067811865474 0.05) // 55
	(-4.0 0 0.05) // 56
	(-4.0 -0.7071067811865479 0.05) // 57
	(-4.0 -4.0 0.05) // 58
	(-0.7071067811865471 -4.0 0.05) // 59
	(0 -4.0 0.05) // 60
	(0.7071067811865477 -4.0 0.05) // 61
	(6.0 -4.0 0.05) // 62
	(6.0 -0.7071067811865479 0.05) // 63

);

blocks
(

	// block 0
	hex (0 8 9 1 32 40 41 33) (10 20 1) simpleGrading (2 1 1)
	// block 1
	hex (1 9 10 2 33 41 42 34) (10 20 1) simpleGrading (2 1 1)
	// block 2
	hex (2 10 11 3 34 42 43 35) (10 20 1) simpleGrading (2 1 1)
	// block 3
	hex (3 11 12 4 35 43 44 36) (10 20 1) simpleGrading (2 1 1)
	// block 4
	hex (4 12 13 5 36 44 45 37) (10 20 1) simpleGrading (2 1 1)
	// block 5
	hex (5 13 14 6 37 45 46 38) (10 20 1) simpleGrading (2 1 1)
	// block 6
	hex (6 14 15 7 38 46 47 39) (10 20 1) simpleGrading (2 1 1)
	// block 7
	hex (7 15 8 0 39 47 40 32) (10 20 1) simpleGrading (2 1 1)
	// block 8
	hex (8 16 17 9 40 48 49 41) (30 20 1) simpleGrading (4 1 1)
	// block 9
	hex (9 17 18 19 41 49 50 51) (30 30 1) simpleGrading (4 4 1)
	// block 10
	hex (42 52 51 41 10 20 19 9) (30 20 1) simpleGrading (4 1 1)
	// block 11
	hex (10 20 21 11 42 52 53 43) (30 20 1) simpleGrading (4 1 1)
	// block 12
	hex (43 55 54 53 11 23 22 21) (15 30 1) simpleGrading (4 4 1)
	// block 13
	hex (44 56 55 43 12 24 23 11) (15 20 1) simpleGrading (4 1 1)
	// block 14
	hex (12 24 25 13 44 56 57 45) (15 20 1) simpleGrading (4 1 1)
	// block 15
	hex (13 25 26 27 45 57 58 59) (15 30 1) simpleGrading (4 4 1)
	// block 16
	hex (46 60 59 45 14 28 27 13) (30 20 1) simpleGrading (4 1 1)
	// block 17
	hex (14 28 29 15 46 60 61 47) (30 20 1) simpleGrading (4 1 1)
	// block 18
	hex (47 63 62 61 15 31 30 29) (30 30 1) simpleGrading (4 4 1)
	// block 19
	hex (40 48 63 47 8 16 31 15) (30 20 1) simpleGrading (4 1 1)

);
edges
(

	arc 0 1 (0.46193976625564337 0.1913417161825449 -0.05)
	arc 1 2 (0.19134171618254492 0.46193976625564337 -0.05)
	arc 2 3 (-0.19134171618254486 0.46193976625564337 -0.05)
	arc 3 4 (-0.46193976625564337 0.19134171618254495 -0.05)
	arc 4 5 (-0.4619397662556434 -0.19134171618254484 -0.05)
	arc 5 6 (-0.19134171618254517 -0.46193976625564326 -0.05)
	arc 6 7 (0.191341716182545 -0.4619397662556433 -0.05)
	arc 7 0 (0.46193976625564326 -0.1913417161825452 -0.05)
	arc 8 9 (0.9238795325112867 0.38268343236508995 -0.05)
	arc 9 10 (0.38268343236509045 0.9238795325112865 -0.05)
	arc 10 11 (-0.3826834323650899 0.9238795325112867 -0.05)
	arc 11 12 (-0.9238795325112864 0.3826834323650905 -0.05)
	arc 12 13 (-0.9238795325112867 -0.38268343236508984 -0.05)
	arc 13 14 (-0.38268343236508895 -0.9238795325112871 -0.05)
	arc 14 15 (0.3826834323650898 -0.9238795325112867 -0.05)
	arc 15 8 (0.9238795325112864 -0.3826834323650906 -0.05)
	arc 32 33 (0.46193976625564337 0.1913417161825449 0.05)
	arc 33 34 (0.19134171618254492 0.46193976625564337 0.05)
	arc 34 35 (-0.19134171618254486 0.46193976625564337 0.05)
	arc 35 36 (-0.46193976625564337 0.19134171618254495 0.05)
	arc 36 37 (-0.4619397662556434 -0.19134171618254484 0.05)
	arc 37 38 (-0.19134171618254517 -0.46193976625564326 0.05)
	arc 38 39 (0.191341716182545 -0.4619397662556433 0.05)
	arc 39 32 (0.46193976625564326 -0.1913417161825452 0.05)
	arc 40 41 (0.9238795325112867 0.38268343236508995 0.05)
	arc 41 42 (0.38268343236509045 0.9238795325112865 0.05)
	arc 42 43 (-0.3826834323650899 0.9238795325112867 0.05)
	arc 43 44 (-0.9238795325112864 0.3826834323650905 0.05)
	arc 44 45 (-0.9238795325112867 -0.38268343236508984 0.05)
	arc 45 46 (-0.38268343236508895 -0.9238795325112871 0.05)
	arc 46 47 (0.3826834323650898 -0.9238795325112867 0.05)
	arc 47 40 (0.9238795325112864 -0.3826834323650906 0.05)
);

boundary
(

  inlet
  {
      type patch;
      faces
      (
         (22 54 55 23)
         (23 55 56 24)
         (24 56 57 25)
         (25 57 58 26)
      );
  }

  outlet
  {
      type patch;
      faces
      (
         (18 50 49 17)
         (17 49 48 16)
         (16 48 63 31)
         (31 63 62 30)
      );
  }

  cylinder
  {
      type wall;
      faces
      (
         (0 32 33 1)
         (1 33 34 2)
         (2 34 35 3)
         (3 35 36 4)
         (4 36 37 5)
         (5 37 38 6)
         (6 38 39 7)
         (7 39 32 0)
      );
  }

  top
  {
      type symmetryPlane;
      faces
      (
         (22 54 53 21)
         (21 53 52 20)
         (20 52 51 19)
         (19 51 50 18)
      );
  }

  bottom
  {
      type symmetryPlane;
      faces
      (
         (26 58 59 27)
         (27 59 60 28)
         (28 60 61 29)
         (29 61 62 30)
      );
  }

);

